function [pf_test,pd_test,pd]=detect_p_unknow_WGN(T,snr,pf)
%%%detect_p_unknow_WGN: 检测随机相位信号---Monte Carlo 仿真
%%%input             T-----------观测时间
%%%                  snr---------信噪比(信号平均功率与噪声平均功率之比)，用数值表示10^(snr/10)
%%%                  pf----------限定的虚警概率  pf<=0.01
%%%output            pd----------理论的正确检测概率
%%%                  pf_test-----仿真实验得到的虚警概率
%%%                  pd_test-----仿真实验得到的正确检测概率
%%%by tanjunhong,2011,6,30
%%%modified 

%pf=0.01,T=0.01,snr=-5     %test this function

%%----信号参数设置----------------------------------------
fs=4000;                  %对接收数据的采样频率
ts=1/fs;                  %采样时间间隔
N=T/ts;                   %观测数据个数
A=1;                      %信号幅度
t=(1:N)'*ts;              %采样时刻的列矢量
fc=250;                   %信号频率

%%%----求理论的正确检测概率--------------------------------
snr=10^(snr/10);          %信噪比
d=sqrt(snr*N);            %d=sqrt(Es/n0);由信噪比表示d^2:信号能量Es与单位频带内噪声功率n0之比
z0=sqrt(-2*log(pf));      %由虚警概率pf反求z0  
pd=marcumq(d,z0);         %理论的正确检测概率值----马库姆Q函数

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%  仿真相关器参考信号  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
gs=A*sin(2*pi*fc*t);      %相关器1参考信号矢量
gc=A*cos(2*pi*fc*t);      %

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%  确定高斯白噪声方差  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Ps=A^2/2;                 %信号的平均功率
Es=Ps*T;                  %观测时间T内信号能量
n0=Es/d^2;                %噪声功率谱密度(双边带):d^2=Es/n0
Pn=n0*fs;                 %噪声的平均功率
sigma=sqrt(Pn);           %噪声的标准差（均值为0）

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%  确定仿真门限     %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Z0=z0*sqrt(n0*Es);


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%   Monte Carlo  仿真   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
pf_test=0;
pd_test=0;
N_exp=5000;                 %仿真次数
for ii=1:N_exp
    %%%%%%  仿真噪声信号      %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    wn=sigma*randn(N,1);  
    %%%%%%  仿真随机相位信号  %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    phi=2*pi*rand(1);       %信号的随机相位
    s=A*sin(2*pi*fc*t+phi); %列信号矢量
    
    %%% H1假设下
    x1=s+wn;
    GS1=gs'*x1*ts;           %相关器输出
    GC1=gc'*x1*ts;
    Z_1=sqrt(GS1^2+GC1^2);   %检测统计量
    if Z_1>Z0
        pd_test=pd_test+1;
    end
    
    %%%% H0假设下
    x0=wn;
    GS0=gs'*x0*ts;           %相关器输出
    GC0=gc'*x0*ts;
    Z_0=sqrt(GS0^2+GC0^2);   %检测统计量
    if Z_0>Z0
        pf_test=pf_test+1;
    end
    
end
pf_test=pf_test/N_exp;
pd_test=pd_test/N_exp;






